var data = [

    { name: '济宁', value: 55 },

    { name: '徐州', value: 55 },

    //{name: '苏州', value:55},

    { name: '张家港', value: 55 },

    { name: '泉州', value: 55 },

    { name: '济南', value: 55 },

    { name: '合肥', value: 55 },

    { name: '宿迁', value: 55 },

    { name: '扬州', value: 55 },

    { name: '南京', value: 55 },

    { name: '上海', value: 55 },

    { name: '镇江', value: 55 },

    { name: '扬中', value: 55 },

    { name: '句容', value: 55 },

    { name: '丹阳', value: 55 },

    //  {name: '湖州', value:55},

    { name: '宿州', value: 55 },

    { name: '宿州泗县', value: 55 },

    { name: '宿州灵璧县', value: 55 },

    { name: '宿州萧县', value: 55 },

    { name: '宿州砀山县', value: 55 },

    // { name: '嘉兴', value: 55 },

    // { name: '昆山', value: 55 },

    { name: '台州玉环县', value: 55 },

    { name: '淮安', value: 55 },

    { name: '山东寿光县', value: 55 },

    { name: '蚌埠', value: 55 },

    { name: '芜湖', value: 55 },

    { name: '海口', value: 55 },

    { name: '三亚', value: 55 },

    { name: '梅州', value: 55 },

    // { name: '中山', value: 55 },

    //{name: '广州', value:55},

    { name: '潮州', value: 55 },

    { name: '汕头', value: 55 },

    { name: '揭阳', value: 55 },

    { name: '汕尾', value: 55 },

    { name: '惠州', value: 55 },

    //{name: '南昌', value:55},

    // {name: '上饶', value:55},

    // {name: '宁夏', value:55},

    { name: '银川', value: 55 },

    { name: '呼和浩特', value: 55 },

    { name: '汉中', value: 55 },

    /*{name: '赤峰', value:55},*/

    { name: '襄阳市南漳县', value: 55 },

    { name: '武威', value: 55 },

    { name: '成都', value: 55 },

    // { name: '齐齐哈尔', value: 55 },

    { name: '安阳', value: 55 },

    { name: '郑州', value: 55 },

    { name: '平顶山', value: 55 },

    //{name: '洛阳', value:55},

    { name: '南阳', value: 55 },

    { name: '天津', value: 55 },

    // { name: '廊坊', value: 55 },

    //{name: '保定', value:55},

    // { name: '沧州', value: 55 },

    { name: '承德', value: 55 },

    //{name: '邢台', value:55},

    { name: '邯郸', value: 55 },

    { name: '西双版纳州', value: 55 },

    //{name: '漯河', value:55},

    { name: '长春', value: 55 },

    // { name: '吉林', value: 55 },

    { name: '北京平谷区', value: 55 },

    { name: '襄阳', value: 55 },

    { name: '贵阳', value: 55 },

    { name: '六盘水', value: 55 },

    { name: '兰州', value: 55 },

    { name: '武汉', value: 55 },

    { name: '大连', value: 55 },

    { name: '绵阳', value: 55 },

    //{name: '河南', value:55},

    { name: '武穴', value: 55 },

    { name: '枣阳', value: 55 },

    { name: '太原', value: 55 },

    { name: '晋城', value: 55 },

    { name: '长沙', value: 55 },

    { name: '无锡', value: 55 },

    { name: '淄博', value: 55 },

    { name: '鹤壁', value: 55 },

    { name: '新乡', value: 55 },

    //{name: '沈阳', value:55},

    { name: '丰城', value: 55 },

    { name: '通辽', value: 55 },

    { name: '宝鸡', value: 55 },

    { name: '秦皇岛', value: 55 },

    { name: '北京密云区', value: 55 },

    { name: '南宁', value: 55 },

    { name: '柳州', value: 55 },

    { name: '珠海', value: 55 },

    { name: '绍兴', value: 55 },

    { name: '杭州', value: 55 },

    { name: '盐城', value: 55 },

    { name: '鞍山', value: 55 },

    { name: '营口', value: 55 },

    // { name: '潍坊', value: 55 },

    // { name: '哈尔滨', value: 55 },

    // { name: '重庆', value: 55 },

    { name: '兴安盟', value: 55 },

    { name: '赣州', value: 55 },

    // { name: '常州', value: 55 },
    { name: '莆田', value: 55 },
    { name: '运城', value: 55 },
    { name: '宁波', value: 55 },
    { name: '乐山', value: 55 },
    { name: '南昌', value: 55 },
    { name: '河源', value: 55 },
    { name: '温州', value: 55 },
    // { name: '乐陵', value: 55 },
    // { name: '昆明', value: 55 },
    { name: '商丘', value: 55 },
    { name: '泰安', value: 55 },
    { name: '青岛', value: 55 },
    //{name: '秦皇岛', value:55},
    { name: '枣庄', value: 55 },
    { name: '泸州', value: 55 },
    { name: '长治', value: 55 },
    { name: '泰州', value: 55 },
    { name: '大庆', value: 55 }

];

var geoCoordMap = {

    '济宁': [116.59, 35.38],

    '徐州': [117.2, 34.26],

    //'苏州':[120.62,31.32],

    '张家港': [120.555821, 31.875428],

    '泉州': [118.58, 24.93],

    '济南': [117, 36.65],

    '合肥': [117.27, 31.86],

    '宿迁': [118.3, 33.96],

    '扬州': [119.42, 32.39],

    '南京': [118.78, 32.04],

    '上海': [121.48, 31.22],

    '镇江': [119.44, 32.2],

    '扬中': [119.7918219160, 32.2390619992],

    '句容': [119.16, 31.95],

    '丹阳': [119.6019920362, 32.0116805045],

    '湖州': [120.1, 30.86],

    '宿州': [116.9586724984, 33.6489011219],

    '宿州泗县': [117.9048687201, 33.4852957736],

    '宿州灵璧县': [117.5438910076, 33.5561944072],

    '宿州萧县': [116.9419050935, 34.1902474337],

    '宿州砀山县': [116.3609981418, 34.4438180247],

    '台州玉环县': [121.2274398953, 28.1391727019],

    '淮安': [119.15, 33.5],

    '山东寿光县': [118.73, 36.86],

    '蚌埠': [117.3834937800, 32.9172006700],

    '芜湖': [118.4277287600, 31.3543000300],

    '海口': [110.35, 20.02],

    '三亚': [109.511909, 18.252847],

    '梅州': [116.1, 24.55],

    '中山': [113.38, 22.52],

    //'广州':[113.23,23.16],

    '潮州': [116.63, 23.68],

    '汕头': [116.69, 23.39],

    '揭阳': [116.35, 23.55],

    '汕尾': [115.375279, 22.786211],

    '惠州': [114.4, 23.09],

    /*'南昌':[115.89,28.68],

	'上饶':[117.9385935288,28.4580143448],

    '宁夏':[106.0542673266,37.4707023690],*/

    '银川': [106.27, 38.47],

    '呼和浩特': [111.65, 40.82],

    '汉中': [107.0192595963, 33.0694890043],

    /*'赤峰':[118.87,42.28],*/

    '襄阳市南漳县': [111.8332439990, 31.7769200460],

    '武威': [102.6363086644, 37.9278218717],

    '成都': [104.06, 30.57],

    '齐齐哈尔': [123.97, 47.33],

    '安阳': [114.3870233300, 36.0975527600],

    '郑州': [113.6188780688, 34.7484216297],

    '平顶山': [113.1861119274, 33.7675813178],

    //'洛阳':[112.44,34.7],

    '南阳': [112.5226966347, 32.9925907133],

    '天津': [117.2, 39.13],

    '廊坊': [116.7, 39.53],

    //'保定':[115.48,38.85],

    '沧州': [116.83, 38.33],

    '承德': [117.93, 40.97],

    //'邢台':[114.48,37.05],

    '邯郸': [114.5334091400, 36.6254469500],

    '西双版纳州': [100.7962473399, 22.0103626541],

    //'漯河':[114.0108952712,33.5829730283],

    '长春': [125.35, 43.88],

    '吉林': [126.57, 43.87],

    '北京平谷区': [117.1148366790, 40.1392098240],

    '襄阳': [112.1164473347, 32.0109937292],

    '贵阳': [106.71, 26.57],

    '六盘水': [104.8276940732, 26.5969520742],

    '兰州': [103.73, 36.03],

    '武汉': [114.31, 30.52],

    '大连': [121.62, 38.92],

    '绵阳': [104.73, 31.48],

    //'河南':[113.0470327479,33.7666850731],

    '武穴': [115.5562074948, 29.8470197200],

    '枣阳': [112.7680823333, 32.1304742721],

    '太原': [112.53, 37.87],

    '晋城': [112.8449873200, 35.4907759500],

    '长沙': [112.9333762442, 28.2313854791],

    '无锡': [120.3077721161, 31.4928483558],

    '淄博': [118.0487315123, 36.8125585025],

    '鹤壁': [114.2915135000, 35.7470673000],

    '新乡': [113.9208444000, 35.3038232600],

    //'沈阳':[123.4570324500,41.6748053700],

    '丰城': [115.7661444200, 28.1625182900],

    '通辽': [122.2391215900, 43.6500969400],

    '宝鸡': [107.2326010700, 34.3633400300],

    //'秦皇岛':[119.5938288900,39.9343152300],

    '北京密云区': [116.8371113100, 40.3750576700],

    '南宁': [108.3628289400, 22.8194172200],

    '柳州': [109.4109115300, 24.3281227100],

    '珠海': [113.5716201200, 22.2737289200],

    '绍兴': [120.5761064100, 30.0329573400],

    '杭州': [120.1504771300, 30.2764960400],

    '盐城': [120.1566862600, 33.3509421200],

    '鞍山': [122.9891500100, 41.1058781600],

    '营口': [122.2296784300, 40.6652274400],

    '潍坊': [119.1558545600, 36.7063965800],

    '哈尔滨': [126.5297361200, 45.8001598000],

    '重庆': [106.5469800800, 29.5675325600],

    '兴安盟': [122.0320818700, 46.0801290900],

    '赣州': [114.9300374800, 25.8342771800],

    '常州': [119.9689073700, 31.8127720500],

    '莆田': [119.0032290600, 25.4570639000],

    '运城': [111.0012014100, 35.0270293600],

    '宁波': [121.5461053500, 29.8764383800],

    '乐山': [103.7631814900, 29.5549685400],

    '南昌': [115.8530407800, 28.6853536800],

    '河源': [114.6959488500, 23.7462997000],

    '温州': [120.6953348500, 27.9982055000],

    '乐陵': [117.2245395200, 37.7283410600],

    '昆明': [102.8317849500, 24.8827108800],

    '商丘': [115.6508451600, 34.4156444000],

    '泰安': [117.0823701800, 36.1997178600],

    '青岛': [120.3778705600, 36.0659670900],

    '秦皇岛': [119.5938288900, 39.9343152300],

    '枣庄': [117.3160845000, 34.8115304200],

    '泸州': [105.4389741800, 28.8747342800],

    '长治': [113.1098728800, 36.1956792500],

    '昆山': [120.9774841100, 31.3867775200],

    '嘉兴': [120.7511853400, 30.7473138500],

    '泰州': [119.924397, 32.489917],

    '大庆': [125.092563, 46.601561]
};

var convertData = function (data) {

    var res = [];

    for (var i = 0; i < data.length; i++) {

        var geoCoord = geoCoordMap[data[i].name];

        if (geoCoord) {

            res.push({

                name: data[i].name,

                value: geoCoord.concat(data[i].value)

            });

        }

    }

    return res;

};
//初始化
var myChart = echarts.init(document.getElementById('map-warp'));

myChart.showLoading();//加载数据前显示的动画效果

//设置参数

myChart.setOption(
    option = {
        backgroundColor: '#000',
        legend: {
            orient: 'vertical',
            y: 'bottom',
            x: 'right',
            //data:['pm2.5'],
            textStyle: {
                color: '#fff'
            }
        },

        geo: {
            map: 'china',
            label: {
                emphasis: {
                    show: false
                }
            },
            roam: true,
            itemStyle: {
                normal: {
                    areaColor: '#4a4a4a',
                    borderColor: '#333'
                },
                emphasis: {
                    areaColor: '#666'
                }
            }
        },
        series: [
            {
                name: '',
                type: 'scatter',
                coordinateSystem: 'geo',
                data: convertData(data),
                symbolSize: function (val) {
                    return val[2] / 10;
                },
                label: {
                    normal: {
                        formatter: '{b}',
                        position: 'right',
                        show: false
                    },
                    emphasis: {
                        show: true
                    }
                },
                itemStyle: {
                    normal: {
                        color: '#ddb926'
                    }
                }
            }
        ]
    });

myChart.hideLoading();//加载数据完成后隐藏动画